---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PointElementChordLength
source: html/c0cbc165-71b9-9757-c5ee-8716ebf2f1e9.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PointElementChordLength Property

"Chord Length"

## Syntax (C#)
```csharp
public static ForgeTypeId PointElementChordLength { get; }
```